# 감지할 색상 설정
rgb_label_dict = {
    # 개미굴 뿔버섯
    (66, 106, 121): "horn",
    (222, 205, 192): "horn",
    (173, 154, 140): "horn",

    # 에오스탑 100층 래츠
    (222, 85, 156): "mouse",
    (231, 81, 156): "mouse",
    (214, 81, 156): "mouse",

    # 하늘 테라스 곰돌이
    (154, 137, 101): "bear",
    #(255, 120, 154): "bear",
    (255, 137, 170): "bear",

    # 남던 커즈 아이
    (99, 174, 99): "curs_eye",    # 커즈

    # 남던 좀비 루팡
    (71, 76, 99): "zombie_lupin",   # 좀루
    (90, 105, 123): "zombie_lupin",   # 좀루 (이동)
    (90, 101, 115): "zombie_lupin",   # 좀루 (피격)

    # 지하철 레이스
    (156, 182, 198): "wraith",

    # 죽숲 좀비
    (222, 239, 206): "zombie",
    (222, 235, 198): "zombie",
    (151, 154, 118): "zombie",
    (137, 120, 101): "zombie",
    (255, 51, 17): "zombie",


    (255, 0, 0): "alert",  # 다른 케릭터 (미니맵)
    (255, 255, 0): "mini_map_me",  # 케릭터 (미니맵)
    (102, 221, 255): "mini_map_portal", # 포탈 (미니맵)

    (0, 68, 221): "me",  # 케릭터 / 파란 머리띠
    #(204, 187, 170): "me",  # 케릭터 / 파란 머리띠
}